In [2]:
import numpy as np
import pandas as pd

In [4]:
#字典构造
data = {'a':[1,2,3,4],
        'b':[5,6,7,8],
        'c':np.arange(9,13)}
frame = pd.DataFrame(data)
frame

   a  b   c
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [5]:
#查看行列索引 数值
frame.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
frame.columns

Index(['a', 'b', 'c'], dtype='object')

In [8]:
frame.values

array([[ 1,  5,  9],
       [ 2,  6, 10],
       [ 3,  7, 11],
       [ 4,  8, 12]], dtype=int64)

In [11]:
#指定index
frame = pd.DataFrame(data,index=['A','B','C','D'],columns=['a','b','c','d'])
frame

   a  b   c    d
A  1  5   9  NaN
B  2  6  10  NaN
C  3  7  11  NaN
D  4  8  12  NaN

In [12]:
#series构建
pd1 = pd.DataFrame({'a':pd.Series(np.arange(3)),
                   'b':pd.Series(np.arange(3,6))})
pd1

   a  b
0  0  3
1  1  4
2  2  5

In [14]:
#字典嵌套
data1 = {
    'a':{'apple':3.6,'banana': 5.6},
    'b':{'apple':3.6,'banana': 5.6},
    'c':{'apple':3.6},
}
pd2 = pd.DataFrame(data1)
pd2

          a    b    c
apple   3.6  3.6  3.6
banana  5.6  5.6  NaN

In [15]:
# 2d ndarray 构造
arr1 = np.arange(12).reshape(4,3)
arr1

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]])

In [16]:
frame1 = pd.DataFrame(arr1)
frame1

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [17]:
#字典构成的列表构造
l1 = [{'apple':3.6,'banana':5.6},{'apple':3.6,'banana':5.6},{'apple':3.6}]
pd3 = pd.DataFrame(l1)
pd3

   apple  banana
0    3.6     5.6
1    3.6     5.6
2    3.6     NaN

In [20]:
#Series构成的列表构造
l2 = [pd.Series(np.random.rand(3)),pd.Series(np.random.rand(2))]
pd4 = pd.DataFrame(l2)
pd4

          0         1         2
0  0.778623  0.511323  0.986073
1  0.490802  0.649526       NaN

In [21]:
#DF基本用法
pd5 = pd.DataFrame(np.arange(9).reshape(3,3),index=['a','c','d'],columns=['A','B','C'])
pd5

   A  B  C
a  0  1  2
c  3  4  5
d  6  7  8

In [22]:
#转置
pd5.T

   a  c  d
A  0  3  6
B  1  4  7
C  2  5  8

In [25]:
#获取数据
pd5['A']

a    0
c    3
d    6
Name: A, dtype: int32

In [28]:
pd5['D'] = [1,2,3]
pd5

   A  B  C  D
a  0  1  2  1
c  3  4  5  2
d  6  7  8  3

In [29]:
del(pd5['D'])
pd5

   A  B  C
a  0  1  2
c  3  4  5
d  6  7  8